app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "16 Candles"], ["director", "John Hughes"], ["created_at", "2018-10-05 19:09:53.586567"], ["updated_at", "2018-10-05 19:09:53.586567"]]

  def find_same_director
    @movies = Movie.same_director(params[:id].to_i)
    @movie = Movie.find(params[:id])
      if @movies.nil? or @movie.director.empty?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 12]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Michael Bay"]]